app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Anonymous guy"], ["body", "This article is dumb"], ["article_id", 1], ["created_at", "2018-08-23 17:21:47.159412"], ["updated_at", "2018-08-23 17:21:47.159412"]]
---
    def create
        @comment = Comment.new(comment_params)
        @comment.article_id = params[:article_id]
        @comment.save