app/models/article.rb

    def tag_list=(tags_string)
        tag_names = tags_string.split(",").collect{|s| s.strip.downcase}.uniq
        new_or_found_tags = tag_names.collect { |name| Tag.find_or_create_by(name: name) }
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "[\"ruby\", \"technology\"]"], ["created_at", "2018-08-23 18:07:31.326507"], ["updated_at", "2018-08-23 18:07:31.326507"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" IN (?, ?) LIMIT ?  [["name", "ruby"], ["name", "technology"], ["LIMIT", 1]]